TSloper-SMTC/usp/examples/mcu_drivers/renesas_ra0e2/svd/R7FA0E209.svd
<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<device xsi:noNamespaceSchemaLocation="CMSIS-SVD.xsd" schemaVersion="1.2" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <vendor>Renesas Electronics Corporation</vendor>
    <vendorID>Renesas</vendorID>
    <name>R7FA0E209</name>
    <series>RA0</series>
    <version>1.00.00</version>
    <description>Arm Cortex-M23 based Microcontroller RA0E2 device</description>
    <licenseText>This software is supplied by Renesas Electronics Corporation and is only intended for \n
use with Renesas products. No other uses are authorized. This software is owned by \n
Renesas Electronics Corporation and is protected under all applicable laws, including \n
copyright laws. \n
\n
THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING \n
THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO \n
WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. \n
ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM EXTENT PERMITTED NOT \n
PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED \n
COMPANIES SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL \n
DAMAGES FOR ANY REASON RELATED TO THIS SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE \n
BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. \n
\n
Renesas reserves the right, without notice, to make changes to this software and to \n
discontinue the availability of this software. By using this software, you agree to \n
the additional terms and conditions found by accessing the following link: \n
http://www.renesas.com/disclaimer \n
\n</licenseText>
    <cpu>
        <name>CM23</name>
        <revision>r1p0</revision>
        <endian>little</endian>
        <mpuPresent>false</mpuPresent>
        <fpuPresent>false</fpuPresent>
        <vtorPresent>true</vtorPresent>
        <nvicPrioBits>2</nvicPrioBits>
        <vendorSystickConfig>false</vendorSystickConfig>
        <deviceNumInterrupts>64</deviceNumInterrupts>
    </cpu>
    <headerSystemFilename>system_RA0E2</headerSystemFilename>
    <headerDefinitionsPrefix>R_</headerDefinitionsPrefix>
    <addressUnitBits>8</addressUnitBits>
    <width>32</width>
    <size>32</size>
    <access>read-write</access>
    <protection>n</protection>
    <resetValue>0</resetValue>
    <resetMask>0xFFFFFFFF</resetMask>
    <peripherals>
        <peripheral>
            <name>SRAM</name>
            <description>SRAM Control</description>
            <baseAddress>0x40002000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x04</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>PARIOAD</name>
                    <description>SRAM Parity Error Operation After Detection Register</description>
                    <addressOffset>0x0000</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>OAD</name>
                            <description>Operation After Detection</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Non-maskable interrupt</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Reset</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SRAMPRCR</name>
                    <description>SRAM Protection Register</description>
                    <addressOffset>0x0004</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>SRAMPRCR</name>
                            <description>Register Write Control</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable writes to protected registers</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable writes to protected registers</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>KW</name>
                            <description>Write Key Code</description>
                            <lsb>1</lsb>
                            <msb>7</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
