TSloper-SMTC/usp/examples/mcu_drivers/renesas_ra0e2/svd/R7FA0E209.svd
                <register>
                    <name>ADUL</name>
                    <description>Conversion Result Comparison Upper Limit Setting Register</description>
                    <addressOffset>0x0111</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0xFF</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>ADLL</name>
                    <description>Conversion Result Comparison Lower Limit Setting Register</description>
                    <addressOffset>0x0112</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>ADTES</name>
                    <description>A/D Test Register</description>
                    <addressOffset>0x0113</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>ADTES</name>
                            <description>Selection of A/D Conversion Target for Testing</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>ANxxx, temperature sensor output voltage or internal reference voltage (Set by analog input channel specification register (ADS))</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>The ‘-’ side reference voltage (selected by the ADREFM bit of the ADM2 register)</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>The ‘+’ side reference voltage (selected by the ADREFP[1:0] bits of the ADM2 register)</description>
                                    <value>#11</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Others</name>
                                    <description>Setting prohibited.</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADCR0</name>
                    <description>12-bit or 10-bit A/D Conversion Result Register 0</description>
                    <addressOffset>0x0120</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>ADCR0H</name>
                    <description>8-bit A/D Conversion Result Register 0</description>
                    <addressOffset>0x0121</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>ADCR1</name>
                    <description>12-bit or 10-bit A/D Conversion Result Register 1</description>
                    <addressOffset>0x0122</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>ADCR1H</name>
                    <description>8-bit A/D Conversion Result Register 1</description>
                    <addressOffset>0x0123</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>ADCR2</name>
                    <description>12-bit or 10-bit A/D Conversion Result Register 2</description>
                    <addressOffset>0x0124</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>ADCR2H</name>
                    <description>8-bit A/D Conversion Result Register 2</description>
                    <addressOffset>0x0125</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>ADCR3</name>
                    <description>12-bit or 10-bit A/D Conversion Result Register 3</description>
                    <addressOffset>0x0126</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>ADCR3H</name>
                    <description>8-bit A/D Conversion Result Register 3</description>
                    <addressOffset>0x0127</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
